---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalLoopType.Void
enum: Autodesk.Revit.DB.Structure.AnalyticalLoopType
source: html/e19a91b9-b428-11a1-61a7-55296df56c2e.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLoopType.Void

Loops that are empty inside.
 In the case of multiple nested loops, this will return a series of loops starting from second most external and every second heading into the most internal.
 In the view returned loops are presented as external outline of openings.